src/k-bench-results/k8s/reliability-control/reliability-control-2/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1465.56          ---          ---        12.39338        11.39100        25.21500        44.79900       112.90 
Gets        14653.89         5.33     14648.56        12.39665        11.39100        25.21500        44.79900       570.99 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      16119.45         5.33     14648.56        12.39635        11.39100        25.21500        44.79900       683.89 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.335        0.000
SET      10.239        5.000
SET      10.751       10.000
SET      10.943       15.000
SET      11.071       20.000
SET      11.135       25.000
SET      11.199       30.000
SET      11.263       35.000
SET      11.327       40.000
SET      11.391       45.000
SET      11.391       50.000
SET      11.455       52.500
SET      11.455       55.000
SET      11.519       57.500
SET      11.519       60.000
SET      11.583       62.500
SET      11.583       65.000
SET      11.647       67.500
SET      11.647       70.000
SET      11.711       72.500
SET      11.775       75.000
SET      11.839       76.250
SET      11.903       77.500
SET      11.967       78.750
SET      12.031       80.000
SET      12.159       81.250
SET      12.351       82.500
SET      12.607       83.750
SET      12.927       85.000
SET      13.311       86.250
SET      13.759       87.500
SET      14.015       88.125
SET      14.271       88.750
SET      14.527       89.375
SET      14.911       90.000
SET      15.551       90.625
SET      16.767       91.250
SET      18.303       91.875
SET      19.711       92.500
SET      20.607       93.125
SET      21.247       93.750
SET      21.503       94.062
SET      21.631       94.375
SET      21.759       94.688
SET      22.015       95.000
SET      22.143       95.312
SET      22.271       95.625
SET      22.399       95.938
SET      22.527       96.250
SET      22.655       96.562
SET      22.655       96.875
SET      22.783       97.031
SET      22.783       97.188
SET      22.911       97.344
SET      22.911       97.500
SET      23.039       97.656
SET      23.167       97.812
SET      23.167       97.969
SET      23.295       98.125
SET      23.423       98.281
SET      23.551       98.438
SET      23.679       98.516
SET      23.679       98.594
SET      23.935       98.672
SET      24.063       98.750
SET      24.319       98.828
SET      24.703       98.906
SET      25.215       98.984
SET      25.727       99.062
SET      26.367       99.141
SET      27.135       99.219
SET      27.519       99.258
SET      28.031       99.297
SET      28.415       99.336
SET      29.055       99.375
SET      29.695       99.414
SET      30.463       99.453
SET      31.231       99.492
SET      32.127       99.531
SET      33.023       99.570
SET      33.791       99.609
SET      34.303       99.629
SET      34.815       99.648
SET      35.583       99.668
SET      36.095       99.688
SET      36.607       99.707
SET      37.119       99.727
SET      37.887       99.746
SET      38.655       99.766
SET      39.167       99.785
SET      39.935       99.805
SET      40.447       99.814
SET      40.959       99.824
SET      41.471       99.834
SET      41.727       99.844
SET      42.239       99.854
SET      42.495       99.863
SET      43.007       99.873
SET      43.775       99.883
SET      44.287       99.893
SET      44.799       99.902
SET      45.055       99.907
SET      45.567       99.912
SET      45.823       99.917
SET      46.335       99.922
SET      46.591       99.927
SET      46.847       99.932
SET      47.359       99.937
SET      47.615       99.941
SET      48.383       99.946
SET      48.895       99.951
SET      49.151       99.954
SET      49.151       99.956
SET      49.663       99.958
SET      49.919       99.961
SET      50.175       99.963
SET      50.943       99.966
SET      51.199       99.968
SET      51.711       99.971
SET      51.967       99.973
SET      52.479       99.976
SET      52.735       99.977
SET      53.247       99.978
SET      53.759       99.979
SET      54.015       99.980
SET      54.527       99.982
SET      55.039       99.983
SET      55.551       99.984
SET      56.063       99.985
SET      56.319       99.987
SET      56.831       99.988
SET      57.087       99.988
SET      57.599       99.989
SET      57.855       99.990
SET      58.367       99.990
SET      58.623       99.991
SET      58.879       99.991
SET      59.903       99.992
SET      60.159       99.993
SET      60.415       99.993
SET      60.671       99.994
SET      61.183       99.994
SET      61.439       99.995
SET      61.951       99.995
SET      62.207       99.995
SET      62.719       99.995
SET      63.231       99.996
SET      64.511       99.996
SET      65.023       99.996
SET      65.023       99.997
SET      66.559       99.997
SET      66.559       99.997
SET      66.559       99.997
SET      67.071       99.997
SET      67.071       99.998
SET      67.071       99.998
SET      67.583       99.998
SET      67.583       99.998
SET      68.095       99.998
SET      68.607       99.998
SET      69.119       99.998
SET      69.631       99.999
SET      69.631       99.999
SET      70.143       99.999
SET      70.143       99.999
SET      70.143       99.999
[...]
SET      71.167       99.999
SET      71.167       99.999
SET      71.679       99.999
SET      73.727       99.999
SET      73.727       99.999
SET      73.727       99.999
[...]
SET      78.335       99.999
SET      78.335      100.000
SET      78.335      100.000
SET      78.847      100.000
SET      78.847      100.000
SET      78.847      100.000
[...]
SET      79.359      100.000
SET      79.359      100.000
SET      79.359      100.000
[...]
SET      82.431      100.000
SET      82.431      100.000
---
GET       1.327        0.000
GET      10.239        5.000
GET      10.751       10.000
GET      10.943       15.000
GET      11.007       20.000
GET      11.135       25.000
GET      11.199       30.000
GET      11.263       35.000
GET      11.327       40.000
GET      11.391       45.000
GET      11.391       50.000
GET      11.455       52.500
GET      11.455       55.000
GET      11.519       57.500
GET      11.519       60.000
GET      11.583       62.500
GET      11.583       65.000
GET      11.647       67.500
GET      11.647       70.000
GET      11.711       72.500
GET      11.775       75.000
GET      11.839       76.250
GET      11.903       77.500
GET      11.967       78.750
GET      12.031       80.000
GET      12.159       81.250
GET      12.351       82.500
GET      12.607       83.750
GET      12.927       85.000
GET      13.375       86.250
GET      13.759       87.500
GET      14.015       88.125
GET      14.271       88.750
GET      14.527       89.375
GET      14.911       90.000
GET      15.615       90.625
GET      16.767       91.250
GET      18.431       91.875
GET      19.711       92.500
GET      20.607       93.125
GET      21.247       93.750
GET      21.503       94.062
GET      21.631       94.375
GET      21.759       94.688
GET      22.015       95.000
GET      22.143       95.312
GET      22.271       95.625
GET      22.399       95.938
GET      22.527       96.250
GET      22.655       96.562
GET      22.655       96.875
GET      22.783       97.031
GET      22.783       97.188
GET      22.911       97.344
GET      22.911       97.500
GET      23.039       97.656
GET      23.167       97.812
GET      23.167       97.969
GET      23.295       98.125
GET      23.423       98.281
GET      23.551       98.438
GET      23.679       98.516
GET      23.679       98.594
GET      23.935       98.672
GET      24.063       98.750
GET      24.319       98.828
GET      24.703       98.906
GET      25.087       98.984
GET      25.727       99.062
GET      26.367       99.141
GET      27.135       99.219
GET      27.647       99.258
GET      28.031       99.297
GET      28.415       99.336
GET      29.055       99.375
GET      29.695       99.414
GET      30.463       99.453
GET      31.231       99.492
GET      31.999       99.531
GET      33.023       99.570
GET      33.791       99.609
GET      34.303       99.629
GET      35.071       99.648
GET      35.583       99.668
GET      36.095       99.688
GET      36.607       99.707
GET      37.119       99.727
GET      37.887       99.746
GET      38.655       99.766
GET      39.167       99.785
GET      39.935       99.805
GET      40.447       99.814
GET      40.703       99.824
GET      41.215       99.834
GET      41.727       99.844
GET      42.239       99.854
GET      42.751       99.863
GET      43.263       99.873
GET      43.775       99.883
GET      44.287       99.893
GET      45.055       99.902
GET      45.311       99.907
GET      45.823       99.912
GET      46.079       99.917
GET      46.591       99.922
GET      46.847       99.927
GET      47.359       99.932
GET      47.615       99.937
GET      48.127       99.941
GET      48.639       99.946
GET      49.151       99.951
GET      49.407       99.954
GET      49.663       99.956
GET      49.919       99.958
GET      50.431       99.961
GET      50.687       99.963
GET      51.199       99.966
GET      51.455       99.968
GET      51.967       99.971
GET      52.735       99.973
GET      53.247       99.976
GET      53.503       99.977
GET      54.015       99.978
GET      54.271       99.979
GET      54.783       99.980
GET      55.039       99.982
GET      55.551       99.983
GET      55.807       99.984
GET      56.319       99.985
GET      56.831       99.987
GET      57.343       99.988
GET      57.599       99.988
GET      57.855       99.989
GET      58.111       99.990
GET      58.367       99.990
GET      58.879       99.991
GET      59.135       99.991
GET      59.647       99.992
GET      59.903       99.993
GET      60.415       99.993
GET      60.927       99.994
GET      61.183       99.994
GET      61.695       99.995
GET      61.951       99.995
GET      62.207       99.995
GET      62.719       99.995
GET      63.231       99.996
GET      63.487       99.996
GET      63.999       99.996
GET      64.767       99.997
GET      65.279       99.997
GET      65.535       99.997
GET      66.047       99.997
GET      66.047       99.997
GET      66.559       99.998
GET      67.071       99.998
GET      67.071       99.998
GET      67.583       99.998
GET      68.095       99.998
GET      68.095       99.998
GET      68.607       99.998
GET      68.607       99.999
GET      69.119       99.999
GET      69.119       99.999
GET      69.119       99.999
GET      69.631       99.999
GET      69.631       99.999
GET      70.143       99.999
GET      70.655       99.999
GET      70.655       99.999
GET      71.167       99.999
GET      71.679       99.999
GET      72.191       99.999
GET      72.703       99.999
GET      73.215       99.999
GET      73.215       99.999
GET      73.727       99.999
GET      73.727      100.000
GET      73.727      100.000
GET      74.239      100.000
GET      74.751      100.000
GET      74.751      100.000
GET      74.751      100.000
[...]
GET      75.263      100.000
GET      75.775      100.000
GET      75.775      100.000
GET      76.287      100.000
GET      76.287      100.000
GET      76.799      100.000
GET      77.311      100.000
GET      77.311      100.000
GET      77.311      100.000
[...]
GET      77.823      100.000
GET      77.823      100.000
GET      78.335      100.000
GET      78.847      100.000
GET      78.847      100.000
GET      78.847      100.000
[...]
GET      79.359      100.000
GET      79.359      100.000
GET      79.359      100.000
[...]
GET      79.871      100.000
GET      79.871      100.000
GET      79.871      100.000
[...]
GET      81.407      100.000
GET      81.407      100.000
---
WAIT      0.000      100.000